<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for the latest unlicensed version of Ekahau Pro.
    NOTE: When launching this App there are PPPC prompts for sh and java.
    The .pkg recipe can handle the sh prompt but the java prompt seems unavoidable</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.download.Ekahau Pro</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Ekahau_Pro</string>
        <key>SEARCH_URL</key>
        <string>https://sw.ekahau.com/download/pro</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string><string>(https://sw.ekahau.com/download/pro/setup/EkahauAIPro-*.*.*.dmg)</string></string>
                <key>result_output_var_name</key>
                <string>url</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Ekahau\ Pro.app</string>
                <key>requirement</key>
                <string>identifier "com.ekahau.wifidesign.ess" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "456L77HQ44"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
